In [93]:
import pandas as pd
import numpy as np
import seaborn as sns
from pydataset import data
#import acquire
from acquire import get_titanic_data , get_iris_data

In [ ]:
# Classification Exercises

In [ ]:
# 1. In a jupyter notebook, classification_exercises.ipynb, use a python module 
#    (pydata or seaborn datasets) containing datasets as a source from the iris data. 
#    Create a pandas dataframe, df_iris, from this data.

# a. print the first 3 rows
# b. print the number of rows and columns (shape)
# c. print the column names
# d. print the data type of each column
# e. print the summary statistics for each of the numeric variables. 
# f. Would you recommend rescaling the data based on these statistics?

In [3]:
# 1. Import pydataset iris 

df_iris = data('iris')

In [10]:
# 1a. Print the first 3 rows

df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [11]:
# 1b. Print the number of rows and columns (shape)

df_iris.shape

(150, 5)

In [12]:
# 1c. Print the column names 

df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [13]:
# 1d. Print the data type of each column

df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [17]:
# 1e. Print the summary statistics for each of the numeric variables.

df_iris.describe() # .T can be used to transpose index and columns

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [18]:
# 1f. Would you recommend rescaling the data based on these statistics?
# The measurements are in cm, I would not recommend rescale this data

In [ ]:
# 2. Read the Table1_CustDetails table from the Excel_Exercises.xlsx file 
#    into a dataframe named df_excel.

# a. assign the first 100 rows to a new dataframe, df_excel_sample
# b. print the number of rows of your original dataframe
# c. print the first 5 column names
# d. print the column names that have a data type of object
# e. compute the range for each of the numeric variables.

In [81]:
df_excel = pd.read_excel('Spreadsheets_Exercises.xlsx', sheet_name = 'Table1_CustDetails')

In [135]:
# 2a. Assign new first 100 rows to a new dataframe

#df_excel_sample = df_excel.head(100)

df_excel_sample = df_excel.loc[0:100, :].copy() # Need to use .copy
df_excel_sample.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,Unnamed: 12,Unnamed: 13
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,NaN,NaN
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,NaN,NaN
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,NaN,NaN
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,NaN,NaN
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,NaN,NaN

In [83]:
df_excel_sample.shape

(100, 14)

In [84]:
#2b. Print the number of rows of your original dataframe

#df_excel.shape
print(f"Number of rows in my original data frame is {df_excel.shape[0]}.")

Number of rows in my original data frame is 7049.

In [85]:
# 2c. Print the first 5 column names

#df_excel.columns[:5]

for x in range(5): 
    print(df_excel.columns[x])

customer_id
gender
is_senior_citizen
partner
dependents

In [86]:
# 2d. Print the column names that have a data type of object
    
# Get info for all columns 

df_excel.dtypes

customer_id           object
gender                object
is_senior_citizen      int64
partner               object
dependents            object
phone_service          int64
internet_service       int64
contract_type          int64
payment_type          object
monthly_charges      float64
total_charges        float64
churn                 object
Unnamed: 12          float64
Unnamed: 13          float64
dtype: object

In [87]:
list(df_excel.select_dtypes(['object']).columns)

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn']

In [88]:
# 2e. Compute the range for each of the numeric variables.

df_excel.select_dtypes(['int64', 'float64']).max() - df_excel.select_dtypes(['int64', 'float64']).min()

is_senior_citizen       1.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
Unnamed: 12             NaN
Unnamed: 13             NaN
dtype: float64

In [89]:
# 3. Read the data from this google sheet into a dataframe, df_google

# a. Print the first 3 rows
# b. Print the number of rows and columns
# c. Print the column names
# d. Print the data type of each column
# e. Print the summary statistics for each of the numeric variables
# f. Print the unique values for each of your categorical variables

In [93]:
# 3. Read the data from this google sheet into a dataframe, df_google

sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

In [94]:
# 3a. Print the first 3 rows

df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [99]:
# 3b. Print the number of rows and columns

print (df_google.shape)
print(f'There are {df_google.shape[0]} rows, and {df_google.shape[1]} columns.')

(891, 12)
There are 891 rows, and 12 columns.

In [133]:
# 3c. Print the column names

df_google.columns.tolist()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [101]:
# 3d. Print the data type of each column

df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [102]:
# 3e. Print the summary statistics for each of the numeric variables

df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [106]:
# 3f. Print the unique values for each of your categorical variables

df_google.select_dtypes('object').nunique()

Name        891
Sex           2
Ticket      681
Cabin       147
Embarked      3
dtype: int64

In [111]:
df_google.Sex.value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64

In [115]:
df_google.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [109]:
df_google.Survived.value_counts(dropna=False)

0    549
1    342
Name: Survived, dtype: int64

In [110]:
df_google.Pclass.value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [113]:
df_google.Parch.value_counts(dropna=False)

0    678
1    118
2     80
3      5
5      5
4      4
6      1
Name: Parch, dtype: int64

In [116]:
df_google.SibSp.value_counts(dropna=False)

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [132]:
# print the unique values for each of your categorical variables
for column in df_google.select_dtypes(include='object').columns:
    print(f"Values in the {column} column:")
    print(df_google[column].value_counts())
    print("------")
    print()

Values in the Name column:
Morley, Mr. Henry Samuel ("Mr Henry Marshall")    1
Collyer, Mr. Harvey                               1
Jussila, Miss. Mari Aina                          1
Karun, Miss. Manca                                1
Roebling, Mr. Washington Augustus II              1
                                                 ..
Panula, Mr. Jaako Arnold                          1
Mionoff, Mr. Stoytcho                             1
Hansen, Mr. Henrik Juul                           1
McCormack, Mr. Thomas Joseph                      1
Aks, Mrs. Sam (Leah Rosen)                        1
Name: Name, Length: 891, dtype: int64
------

Values in the Sex column:
male      577
female    314
Name: Sex, dtype: int64
------

Values in the Ticket column:
1601        7
CA. 2343    7
347082      7
3101295     6
CA 2144     6
           ..
349204      1
36967       1
113503      1
8475        1
349210      1
Name: Ticket, Length: 681, dtype: int64
------

Values in the Cabin column:
C23 C25 C27        4
B96 B98            4
G6                 4
C22 C26            3
E101               3
F33                3
D                  3
F2                 3
E121               2
C78                2
D17                2
B22                2
C83                2
B58 B60            2
B28                2
C126               2
B20                2
B49                2
E25                2
D36                2
F G73              2
C124               2
C93                2
D35                2
B5                 2
C123               2
E24                2
C92                2
C125               2
D20                2
C68                2
E8                 2
D26                2
E67                2
D33                2
C2                 2
E33                2
C52                2
B57 B59 B63 B66    2
F4                 2
B35                2
C65                2
B77                2
B51 B53 B55        2
B18                2
E44                2
A20                1
B4                 1
A31                1
T                  1
E12                1
E31                1
C110               1
D9                 1
C103               1
C46                1
C7                 1
B41                1
E40                1
E49                1
E68                1
F G63              1
C85                1
C70                1
C82                1
B39                1
C91                1
B101               1
A6                 1
D37                1
C111               1
C99                1
B50                1
C87                1
C118               1
D6                 1
B69                1
E17                1
C101               1
C47                1
D21                1
E36                1
C54                1
E10                1
C45                1
B3                 1
D10 D12            1
E77                1
B73                1
A19                1
B86                1
D11                1
C86                1
C32                1
D46                1
C95                1
E34                1
A34                1
C104               1
B79                1
B37                1
D56                1
D45                1
C106               1
A23                1
D48                1
D19                1
F38                1
A5                 1
A36                1
C50                1
F E69              1
D7                 1
D47                1
C62 C64            1
C90                1
A14                1
A26                1
B42                1
A10                1
E58                1
D50                1
C49                1
A7                 1
A16                1
B82 B84            1
B38                1
E63                1
B102               1
C30                1
E38                1
B71                1
E50                1
D49                1
C128               1
A32                1
B19                1
D30                1
B94                1
A24                1
C148               1
E46                1
D15                1
D28                1
B80                1
B30                1
B78                1
Name: Cabin, dtype: int64
------

Values in the Embarked column:
S    644
C    168
Q     77
Name: Embarked, dtype: int64
------

In [ ]:
# Make a new python module, acquire.py to hold the following data aquisition functions:

In [4]:
# 1. Make a function named get_titanic_data that returns the titanic data from the 
#    codeup data science database as a pandas data frame.Use the function you defined 
#    in acquire.py to load the titanic dataset.

# Getting sql data

titanic_df = acquire.get_titanic_data()

In [5]:
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [6]:
iris_df = acquire.get_iris_data()

In [7]:
iris_df.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

In [3]:
# Prepare Data Exercises

In [ ]:
# The end product of this exercise should be the specified functions in a python script 
# named prepare.py. Do these in your classification_exercises.ipynb first, then transfer 
# to the prepare.py file.

In [ ]:
# Using the Iris Data:

In [71]:
# 1. Use the function defined in acquire.py to load the iris data.

iris_df = get_iris_data()

In [72]:
iris_df.shape

(150, 6)

In [73]:
iris_df.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

In [74]:
# 2. Drop the species_id and measurement_id columns.

# Excluded measurement_id column in sql query in the acquire.py

iris_df = iris_df.drop(columns = ['species_id'])
iris_df.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

In [76]:
# 3. Rename the species_name column to just species.

iris_df.rename(columns={"species_name": "species"}, inplace =True)
iris_df.head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

In [59]:
# 4. Create dummy variables of the species name.

dummy_df = pd.get_dummies(iris_df.species)
dummy_df.head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

In [78]:
# drop the first dummy column because it is a redundant feature
# setosa, versicolor, virginica

dummy_df = pd.get_dummies(iris_df.species, drop_first=[True])
dummy_df.head()

   versicolor  virginica
0           0          0
1           0          0
2           0          0
3           0          0
4           0          0

In [79]:
iris_df = pd.concat([iris_df, dummy_df], axis=1)
iris_df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0

In [26]:
# 5. Create a function named prep_iris that accepts the untransformed iris data, 
#    and returns the data with the transformations above applied.

In [81]:
def prep_iris(iris_df):
    iris_df = iris_df.drop(columns = ['species_id'])
    iris_df = iris_df.rename(columns=({'species_name': 'species'}))
    dummy_df = pd.get_dummies(iris_df.species, drop_first=[True])
    iris_df = pd.concat([iris_df, dummy_df], axis=1)
    return iris_df

In [84]:
# Test function

iris_df = get_iris_data()
iris_df = prep_iris(iris_df)
iris_df.sample(10)

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
74,versicolor,6.4,2.9,4.3,1.3,1,0
113,virginica,5.7,2.5,5.0,2.0,0,1
79,versicolor,5.7,2.6,3.5,1.0,1,0
40,setosa,5.0,3.5,1.3,0.3,0,0
116,virginica,6.5,3.0,5.5,1.8,0,1
68,versicolor,6.2,2.2,4.5,1.5,1,0
103,virginica,6.3,2.9,5.6,1.8,0,1
76,versicolor,6.8,2.8,4.8,1.4,1,0
142,virginica,5.8,2.7,5.1,1.9,0,1
55,versicolor,5.7,2.8,4.5,1.3,1,0

In [ ]:
# Tidy Data Exercises

In [94]:
# 1. Attendance Data

# Load the attendance.csv file and calculate an attendnace percentage for each student. 
# One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

# You should end up with something like this:

#  name
#  Billy    0.5250
#  Jane     0.6875
#  John     0.9125
#  Sally    0.7625
#  Name: grade, dtype: float64

In [106]:
# load and look at data

attendance = pd.read_csv('untidy-data/attendance.csv')
attendance.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [107]:
# look at shape

attendance.shape

(4, 9)

In [108]:
# look at info

attendance.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   2018-01-01  4 non-null      object
 2   2018-01-02  4 non-null      object
 3   2018-01-03  4 non-null      object
 4   2018-01-04  4 non-null      object
 5   2018-01-05  4 non-null      object
 6   2018-01-06  4 non-null      object
 7   2018-01-07  4 non-null      object
 8   2018-01-08  4 non-null      object
dtypes: object(9)
memory usage: 416.0+ bytes

In [109]:
# rename column

attendance.rename(columns={'Unnamed: 0': 'student'}, inplace=True)
attendance.head()

,student,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [111]:
# melt the data

attendance_melt = pd.melt(attendance, id_vars='student', var_name = 'date', value_name= 'attendance')
attendance_melt.head()

  student        date attendance
0   Sally  2018-01-01          P
1    Jane  2018-01-01          A
2   Billy  2018-01-01          A
3    John  2018-01-01          P
4   Sally  2018-01-02          T

In [112]:
# function to convert letter to number

def attendance_percent(letter):
    if letter == 'P':
        return 1
    elif letter == 'H':
        return 0.5
    elif letter == 'T':
        return 0.9
    else:
        return 0

In [117]:
# calculate an attendance percentage for each student
# one half day is worth 50% of a full day, and 10 tardies is equal to one absence

attendance_melt['attendance_percent'] = attendance_melt['attendance'].apply(attendance_percent)
attendance_melt.head()

  student        date attendance  attendance_percent
0   Sally  2018-01-01          P                 1.0
1    Jane  2018-01-01          A                 0.0
2   Billy  2018-01-01          A                 0.0
3    John  2018-01-01          P                 1.0
4   Sally  2018-01-02          T                 0.9

In [119]:
# used groupby to calculate the mean grade

attendance_melt.groupby('student').attendance_percent.mean()

student
Billy    0.5250
Jane     0.6875
John     0.9125
Sally    0.7625
Name: attendance_percent, dtype: float64

In [ ]:
# 2. Coffee Levels

# a. Read the coffee_levels.csv file.
# b. Transform the data so that each carafe is in it's own column.
# c. Is this the best shape for the data?

In [120]:
# load and look at data

coffee = pd.read_csv('untidy-data/coffee_levels.csv')

In [121]:
coffee.head()

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

In [128]:
coffee.shape

(30, 3)

In [129]:
coffee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   hour           30 non-null     int64
 1   coffee_carafe  30 non-null     object
 2   coffee_amount  30 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 848.0+ bytes

In [123]:
# b. Transform the data so that each carafe is in it's own column.

coffee_carafe = coffee.pivot_table(index = 'hour', columns = 'coffee_carafe', values='coffee_amount').reset_index()
coffee_carafe

coffee_carafe  hour         x         y         z
0                 8  0.816164  0.189297  0.999264
1                 9  0.451018  0.521502  0.915990
2                10  0.843279  0.023163  0.144928
3                11  0.335533  0.235529  0.311495
4                12  0.898291  0.017009  0.771947
5                13  0.310711  0.997464  0.398520
6                14  0.507288  0.058361  0.864464
7                15  0.215043  0.144644  0.436364
8                16  0.183891  0.544676  0.280621
9                17  0.391560  0.594126  0.436677

In [ ]:
# c. Is this the best shape for the data?

#It is easy to read, but to use for data reporting I prefer the original.

In [ ]:
# 3. Cake Recipes

# Read the cake_recipes.csv data. This data set contains cake tastiness scores for 
# combinations of different recipes, oven rack positions, and oven temperatures.

# Tidy the data as necessary.

# Which recipe, on average, is the best? recipe b
# Which oven temperature, on average, produces the best results? 275

# Which combination of recipe, rack position, and temperature gives the best result? 
# recipe b, bottom rack, 300 degrees

In [134]:
# load and look at data

cake_recipe = pd.read_csv('untidy-data/cake_recipes.csv')

In [135]:
cake_recipe.head()

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084

In [136]:
cake_recipe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   recipe:position  8 non-null      object
 1   225              8 non-null      float64
 2   250              8 non-null      float64
 3   275              8 non-null      float64
 4   300              8 non-null      float64
dtypes: float64(4), object(1)
memory usage: 448.0+ bytes

In [137]:
cake_recipe.shape

(8, 5)

In [139]:
# Tidy the data as necessary.

cake = cake_recipe['recipe:position'].str.split(':', expand=True)

In [140]:
cake

   0       1
0  a  bottom
1  a     top
2  b  bottom
3  b     top
4  c  bottom
5  c     top
6  d  bottom
7  d     top

In [141]:
cake.columns=['recipe','position']
cake

  recipe position
0      a   bottom
1      a      top
2      b   bottom
3      b      top
4      c   bottom
5      c      top
6      d   bottom
7      d      top

In [144]:
cake_df = pd.concat([cake, cake_recipe], axis=1)
cake_df

  recipe position recipe:position        225        250        275        300
0      a   bottom        a:bottom  61.738655  53.912627  74.414730  98.786784
1      a      top           a:top  51.709751  52.009735  68.576858  50.228470
2      b   bottom        b:bottom  57.095320  61.904369  61.196980  99.248541
3      b      top           b:top  82.455004  95.224151  98.594881  58.169349
4      c   bottom        c:bottom  96.470207  52.001358  92.893227  65.473084
5      c      top           c:top  71.306308  82.795477  92.098049  53.960273
6      d   bottom        d:bottom  52.799753  58.670419  51.747686  56.183110
7      d      top           d:top  96.873178  76.101363  59.571620  50.971626

In [145]:
cake_df = cake_df.drop(columns=['recipe:position'])

In [146]:
cake_df

  recipe position        225        250        275        300
0      a   bottom  61.738655  53.912627  74.414730  98.786784
1      a      top  51.709751  52.009735  68.576858  50.228470
2      b   bottom  57.095320  61.904369  61.196980  99.248541
3      b      top  82.455004  95.224151  98.594881  58.169349
4      c   bottom  96.470207  52.001358  92.893227  65.473084
5      c      top  71.306308  82.795477  92.098049  53.960273
6      d   bottom  52.799753  58.670419  51.747686  56.183110
7      d      top  96.873178  76.101363  59.571620  50.971626

In [147]:
cake_melt = cake_df.melt(id_vars=['recipe','position'], var_name = 'temperature', value_name = 'score')
cake_melt

   recipe position temperature      score
0       a   bottom         225  61.738655
1       a      top         225  51.709751
2       b   bottom         225  57.095320
3       b      top         225  82.455004
4       c   bottom         225  96.470207
5       c      top         225  71.306308
6       d   bottom         225  52.799753
7       d      top         225  96.873178
8       a   bottom         250  53.912627
9       a      top         250  52.009735
10      b   bottom         250  61.904369
11      b      top         250  95.224151
12      c   bottom         250  52.001358
13      c      top         250  82.795477
14      d   bottom         250  58.670419
15      d      top         250  76.101363
16      a   bottom         275  74.414730
17      a      top         275  68.576858
18      b   bottom         275  61.196980
19      b      top         275  98.594881
20      c   bottom         275  92.893227
21      c      top         275  92.098049
22      d   bottom         275  51.747686
23      d      top         275  59.571620
24      a   bottom         300  98.786784
25      a      top         300  50.228470
26      b   bottom         300  99.248541
27      b      top         300  58.169349
28      c   bottom         300  65.473084
29      c      top         300  53.960273
30      d   bottom         300  56.183110
31      d      top         300  50.971626

In [151]:
# Which recipe, on average, is the best? recipe b

best_results = cake_melt.groupby('recipe').mean()

best_cake = best_results
best_cake.sort_values('score',ascending = False).head(1)

            score
recipe
b       76.736074

In [149]:
# Which oven temperature, on average, produces the best results? 275

best_results = cake_melt.groupby('temperature').mean()
best_results.sort_values('score', ascending = False).head(1)

                 score
temperature
275          74.886754

In [150]:
# Which combination of recipe, rack position, and temperature gives the best result? 
# recipe b, bottom rack, 300 degrees

cake_melt.sort_values('score', ascending = False).head(1)

   recipe position temperature      score
26      b   bottom         300  99.248541